Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoint Method
Overload List
Name | Description
PickPoint()
 Queries the user to pick a point from the model.
PickPoint(String)
 Queries the user to pick a point from the model with the given prompt.
PickPoint(Point)
 Queries the user to pick a point from the model with reference to the given point.
PickPoint(String, Point)
 Queries the user to pick point with given prompt and reference to another point.
Top
See Also
Reference
Picker Class
Tekla.Structures.Model.UI Namespace